# [ DataFrame 살펴보기 ]
* 데이터를 테이블 즉, 표 형태로 저장하는 자료 구조
* 구성 : 행 + 열
* 생성 : pandas.DataFrame() 생성자 메서드

(1) 모듈 로딩 -------------------

In [234]:
from pandas import DataFrame

(2) 데이터 준비 -

In [235]:
data = [ [11,22,33], [44,55,66]] # 행마다 들어감

(3) DataFrame으로 저장 즉, DataFrame 객체 생성-----------

In [236]:
df1 = DataFrame(data)
df1

    0   1   2
0  11  22  33
1  44  55  66

(4) DataFrame의 속성 읽기 => 객체 변수명.속성명 --------

In [237]:
df1.index # 몇 행인지

RangeIndex(start=0, stop=2, step=1)

In [238]:
df1.columns #몇 열인지

RangeIndex(start=0, stop=3, step=1)

In [239]:
df1.values # 행별 정렬

array([[11, 22, 33],
       [44, 55, 66]])

In [240]:
# 데이터가 저장된 표의 형태
df1.shape #2행 3열

(2, 3)

In [241]:
# 데이터의 차원정보 n-dimention
df1.ndim

2

In [242]:
# 컬럼별 데이터 타입
df1.dtypes  # 열별 타입

0    int64
1    int64
2    int64
dtype: object

(5) 원소 읽기 ==> 행과 열 지정 ===> 1개 원소

- 컬럼 즉, 열(column) 읽기

In [243]:
df1

    0   1   2
0  11  22  33
1  44  55  66

In [244]:
df1[0]

0    11
1    44
Name: 0, dtype: int64

In [245]:
df1[2]

0    33
1    66
Name: 2, dtype: int64

In [246]:
#df1[-2] 음수는 에러

In [247]:
## 컬럼 변경 ===============================
df1.columns=['A','B','C']
df1

    A   B   C
0  11  22  33
1  44  55  66

In [248]:
df1['A']

0    11
1    44
Name: A, dtype: int64

In [249]:
df1.A

0    11
1    44
Name: A, dtype: int64

In [250]:
# df1[0] columns에서는 문자열을 부여하면 자동부여 정수 인덱스는 작동 안 함

In [251]:
df1.columns=[0,1,2]

In [252]:
df1

    0   1   2
0  11  22  33
1  44  55  66

In [253]:
df1[0]

0    11
1    44
Name: 0, dtype: int64

In [254]:
# df1.0 은 원래 안됨

- 로우 즉, 행(row) 읽기 ==> 방법 2가지
  * 위  치 인덱스로 읽기 : 객체변수명.iloc[인덱스]
  * 레이블 인덱스로 읽기 : 객체변수명.loc[인덱스]

In [255]:
df1.index=['one', 'two']
df1

      0   1   2
one  11  22  33
two  44  55  66

In [256]:
df1.loc['one']

0    11
1    22
2    33
Name: one, dtype: int64

In [257]:
one = df1.loc['one']

In [258]:
type(one)

pandas.core.series.Series

In [259]:
df1.iloc[0]

0    11
1    22
2    33
Name: one, dtype: int64

In [260]:
zero = df1.iloc[0]

In [261]:
type(zero)

pandas.core.series.Series

(6) 모든 원소를 한 번에 한 개씩만 출력

In [262]:
df1

      0   1   2
one  11  22  33
two  44  55  66

In [263]:
df1.iloc[0]

0    11
1    22
2    33
Name: one, dtype: int64

In [264]:
one = df1.loc['one']
one
for i in range(2):
    print(one[i])

11
22

In [265]:
for i in list(df1.index):
    for j in list(df1.columns):
        print(df1[j][i]) # col, row

11
22
33
44
55
66

- 객체변수명.iloc[행 인덱스, 열 인덱스] / 객체변수명.loc[행레이블, 열 인덱스 or 열 레이블]

In [266]:
df1.iloc[0,0], df1.iloc[0,1], df1.iloc[0,2]

(11, 22, 33)

In [267]:
df1.loc['one',0]

11

In [268]:
df1.loc['one',0], df1.loc['one', 1], df1.loc['one',2], df1.loc['two',0], df1.loc['two',1], df1.loc['two',2]

(11, 22, 33, 44, 55, 66)

In [269]:
df1.columns=['A','B','C']
df1

      A   B   C
one  11  22  33
two  44  55  66

In [270]:
df1.loc['one']['B'], df1.loc['two']['C']

(22, 66)

In [271]:
for i in range(2):
    print(df1.iloc[i])

A    11
B    22
C    33
Name: one, dtype: int64
A    44
B    55
C    66
Name: two, dtype: int64

In [272]:
df1.iloc[0]

A    11
B    22
C    33
Name: one, dtype: int64

In [273]:
df1.iloc[0, 1], df1.iloc[1,2]

(22, 66)

In [274]:
df1.iloc[0][1], df1.iloc[1][2]

(22, 66)

In [275]:
zero = df1.iloc[0]
zero

A    11
B    22
C    33
Name: one, dtype: int64

In [276]:
b=df1['B']
b

one    22
two    55
Name: B, dtype: int64

개-멍청하다 진짜....
for문 안에 print() 안해서 안 나오다니

In [277]:
df1.index, df1.columns

(Index(['one', 'two'], dtype='object'), Index(['A', 'B', 'C'], dtype='object'))

In [278]:
df1.shape[0], df1.shape[1]

(2, 3)

- iloc를 활용한 모든 원소 출력 == 행과 열의 번호 필요

In [279]:
for row in range(df1.shape[0]):
    # print(row)
    for col in range(df1.shape[1]):
        # print(row, col)
        print(df1.iloc[row][col])

11
22
33
44
55
66

In [280]:
for i in range(df1.shape[0]):
    for j in range(df1.shape[1]):
        print(df1.iloc[i][j])

11
22
33
44
55
66

- loc를 활용한 모든 원소 출력 ==> 행 레이블/이름과 열 레이블/이름 필요

In [281]:
df1.index, df1.columns

(Index(['one', 'two'], dtype='object'), Index(['A', 'B', 'C'], dtype='object'))

In [283]:
for i in df1.index:
    for j in df1.columns:
        print(df1.loc[i][j], end=' ')

11 22 33 44 55 66

#### [ 문제 ] one, three 행을 선택 후 저장

In [289]:
data1 = [[11, 22, 33], [44, 55, 66], [77, 88, 99] ]
data1 = DataFrame(data1)
data1

    0   1   2
0  11  22  33
1  44  55  66
2  77  88  99

In [290]:
data1.columns=['A','B','C']
data1.index=['one', 'two', 'three']
data1

        A   B   C
one    11  22  33
two    44  55  66
three  77  88  99

In [295]:
d1 = data1.loc[['one', 'three']]
d1

        A   B   C
one    11  22  33
three  77  88  99

In [297]:
d2 = data1.loc[['one']]
d2

      A   B   C
one  11  22  33

In [299]:
d3 = data1.loc['one']
d3

A    11
B    22
C    33
Name: one, dtype: int64

In [300]:
data = [[11, 22, 33], [44, 55, 66], [77, 88, 99]]
df1 = DataFrame(data, ["one", "two", "three"], ["A", "B", "C"])
df1

        A   B   C
one    11  22  33
two    44  55  66
three  77  88  99